# ConnectLevels Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultistoryStairs..::..ConnectLevels Method
MultistoryStairs Class See Also
---
Extends the multistory stairs by connecting input levels.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void ConnectLevels(
	ISet<ElementId> levelIds
)
```

Visual Basic
---
```text
Public Sub ConnectLevels ( _
	levelIds As ISet(Of ElementId) _
)
```

Visual C++
---
```text
public:
void ConnectLevels(
	ISet<ElementId^>^ levelIds
)
```

# ### Parameters
levelIds
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> The level ids.
# Remarks
The added stairs will be categorized into different groups based on level heights automatically. Stairs with the same level height are considered a group and can be edited together. You cannot connect the levels between standard stairs top and bottom or already connected.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This multistory stairs cannot connect to one or more members of levelIds. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace